/* $Source: /source/hpux_source/kernel/sys.SWT68K_300/s200io/RCS/mux.c,v $
 * $Revision: 1.7.84.6 $	$Author: rpc $
 * $State: Exp $   	$Locker: rpc $
 * $Date: 93/12/16 09:35:45 $
 */

/* 
(c) Copyright 1983, 1984, 1985, 1986, 1987, 1988 Hewlett-Packard Company.
(c) Copyright 1979 The Regents of the University of Colorado, a body corporate 
(c) Copyright 1979, 1980, 1983 The Regents of the University of California
(c) Copyright 1980, 1984, 1986 AT&T Technologies.  All Rights Reserved.
The contents of this software are proprietary and confidential to the Hewlett-
Packard Company, and are limited in distribution to those with a direct need
to know.  Individuals having access to this software are responsible for main-
taining the confidentiality of the content and for keeping the software secure
when not in use.  Transfer to any party is strictly forbidden other than as
expressly permitted in writing by Hewlett-Packard Company.  Unauthorized trans-
fer to or possession by any unauthorized party may be a criminal offense.

                    RESTRICTED RIGHTS LEGEND

          Use,  duplication,  or disclosure by the Government  is
          subject to restrictions as set forth in subdivision (b)
          (3)  (ii)  of the Rights in Technical Data and Computer
          Software clause at 52.227-7013.

                     HEWLETT-PACKARD COMPANY
                        3000 Hanover St.
                      Palo Alto, CA  94304
*/

/*
	MUX driver
*/

#include "../h/param.h"		/* various types and macros */
#include "../h/errno.h"
#include "../h/file.h"
#include "../h/tty.h"		/* tty structure and parameters */
#include "../h/conf.h"		/* linesw stuff */
#include "../wsio/intrpt.h"
#include "../wsio/hpibio.h"
#define _INCLUDE_TERMIO
#include "../s200io/mux.h"
#include "../h/termios.h"
#include "../h/modem.h"
#include "../h/ld_dvr.h"

/* MUX shared memory definitions  See 98642-90001 for details */

/* per-card shared memory definition */

struct mux_io_0k {		/* 0..0x7FFF I/O space */
	u_char	x0;
	u_char	reset;		/* 0x0001 ... write = reset, read = id */
	u_char	x2;
	u_char	interrupt;	/* 0x0003 */
	u_char	x4;
	u_char	semaphore;	/* 0x0005 */
	u_char	xa[0x8000 - 0x0005 -1];
};

struct modem {			/* modem control structure */
	u_char	x0;
	u_char	in;
	u_char	x2;
	u_char	out;
	u_char	x4;
	u_char	mask;
};

struct mux_io_8k {		/* 0x8000..0xFFFF I/O space */
	u_char	x8000;
	u_char	int_cond;	/* 0x8001 */
	u_char	x8002;
	u_char	command;	/* 0x8003 */
	u_char	xa[0x8c01 - 0x8003 - 1];
	u_char	bitmap[256*2];	/* 0x8c01 */
	u_char	xb[0x8e30 - 0x8c01 - 256*2];
	struct	modem modem0;	/* 0x8e30 - 0x8e35 */
	u_char	xc[0x8e47 - 0x8e35 - 1];
	u_char	st_cond;	/* 0x8e47 */
	struct	modem modem1;	/* 0x8e48 - 0x8e4d */
	struct	modem modem2;	/* 0x8e4e - 0x8e53 */
	struct	modem modem3;	/* 0x8e54 - 0x8e59 */
	u_char	x8e5a;
	u_char	mcntl_reg;	/* 0x8e5b */
	u_char	x8e5c;
	u_char	mstat_reg;	/* 0x8e5d */
	u_char	xd[0xffff - 0x8e5d];
};

/*
 * 15 May 92    jlau
 *
 * We needed to add a new field (i.e. open_count for successful open)
 * in the hardware structure which tp->utility points to.  However,
 * we could not simply add it to the hardware structure (i.e. mux_io_8k) 
 * directly because that will cause a mismatch between the SW structue
 * and IO hardware layout.  Instead, we created a new structure (called
 * mux_hw_data) to store the open_count and a pointer to the the mux_io_8k 
 * structure.  Now, the tp->utility will point to the this new structure 
 * and any reference to the mux_io_8K structure will be accessed
 * via tp->utility->mux_io_ptr istead. 
 *
 * WARNING: the common code (i.e. ttycomn.c) shares by the the pdi.c
 *          the pci.c, the apollo_pci.c and the mux.c drivers assumes
 *          that the tp->utility points to the open_count. Therefore,
 *          do NOT move the location of the open_count when new fields
 *          need to be added to the HW data structure.
 */
struct mux_hw_data {
	u_int				open_count;	/* this field must be */
							/* the 1st one	      */
	u_int				vhangup;
	struct mux_io_8k	*	mux_io_ptr;
};

/* Temporary until a function code can be pt into tty.h */
#define	T_VHANGUP	-1

struct mux_port_io {		/* per-port I/O space:
					base_addr = 0x8e01 + (port*2) */
	u_char	rhead;		/* 0x8e01 */
	u_char	xa[0x8e09 - 0x8e01 - 1];
	u_char	rtail;		/* 0x8e09 */
	u_char	xb[0x8e11 - 0x8e09 - 1];
	u_char	thead;		/* 0x8e11 */
	u_char	xc[0x8e19 - 0x8e11 - 1];
	u_char	ttail;		/* 0x8e19 */
	u_char	xd[0x8e37 - 0x8e19 - 1];
	u_char	cmnd_tab;	/* 0x8e37 */
	u_char	xe[0x8e3f - 0x8e37 - 1];
	u_char	icr_tab;	/* 0x8e3f */
};

/* per-port macros */

#define TBUFF(port)	(0x8f41 - (port<<5))
#define BD(port)	(0x8e23 + (port<<2))

#undef	M_PARITY_ODD
#undef	M_PARITY_EVEN
#undef	M_TWO_STOP_BITS
/* addr0k + CONFG(port)		Configuration masks */
#define CONFG(port)	(0x8e21 + (port<<2))
#define	M_PARITY_ODD	0x01
#define	M_PARITY_EVEN	0x02
#define	M_TWO_STOP_BITS	0x08
#define	M_6_BITS	0x10
#define	M_7_BITS	0x20
#define	M_8_BITS	0x30
#define HWCSIZE		0x30

/* addr0k + RBUFF(port)		Character status masks */
#define RBUFF(port)	(0x8a01 - (port<<9))
#define	STATUS_MASK	0xf8
#define	FRAME_ERROR	0x80
#define	OVERRUN_ERROR	0x40
#define	PARITY_ERROR	0x20
#define	BREAK_DETECT	0x10
#define	BUFFER_OVERFLOW	0x08

/* addr->modm_out   - Modem Control masks */
#define	MUX_RTS		0x01
#define	MUX_DTR		0x02
#define	MUX_DRS		0x04

/* addr->modm_in    - Modem Status masks */
#define	MUX_RI		0x01
#define	MUX_DCD		0x02
#define	MUX_DSR		0x04
#define	MUX_CTS		0x08

/* Interrupt Service Routine structures */

