calmsacibis995/hpux-910-src/source_product/9.10/ARPA/PRODUCT/xntp/docs/ntptrace.1m
.ds )H Hewlett-Packard Company
.ds ]W  Unsupported
.TH ntptrace 1m Unsupported
.SH NAME
ntptrace - trace a chain of NTP hosts back to their master time source
.SH SYNOPSIS
.B ntptrace
[
.B -vdn
] [
.B -r
.I retries
] [
.B -t
.I timeout
] [
.I server
]
.SH DESCRIPTION
.I ntptrace
determines where a given Network Time Protocol (NTP) server gets
its time from, and follows the chain of NTP servers back to their
master time source.
If given no arguments, it starts with ``localhost.''
.PP
Here is an example of the output from
.IR ntptrace :
.RS 2
.nf

% ntptrace
localhost: stratum 4, offset 0.0019529, synch distance 0.144135
server2.bozo.com: stratum 2, offset 0.0124263, synch distance 0.115784
usndh.edu: stratum 1, offset 0.0019298, synch distance 0.011993, refid 'WWVB'

.fi
.RE
On each line, the fields are (left to right): the host name, the
host's stratum,
the time offset between that host and the local host
(as measured by
.IR ntptrace ;
this is why it is not always zero for "localhost"),
the host's "synchronization distance,"
and (only for stratum-1 servers) the reference clock ID.  All times
are given in seconds.  (Synchronization distance is a measure of the
goodness of the clock's time.)
.SH OPTIONS
.RS
.TP 12
.B -d
Turns on some debugging output.
.TP 
.B -n
Turns off the printing of host names; instead, host IP addresses
are given.  This may be necessary if a nameserver is down.
.TP 
.BR -r retries
Sets the number of retransmission attempts for each host; default = 5.
.TP 
.BR -t timeout
Sets the retransmission timeout (in seconds); default = 2.
.TP 
.B -v
Prints verbose information about the NTP servers.
.RE
.SH SEE ALSO
xntpd(1m), xntpdc(1m)
.SH BUGS
This program makes no attempt to improve accuracy by doing multiple
samples.
